docs/benchmarks/20260512_204000_ab_test_soldout_log/A_k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /script.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 2m0s max duration (incl. graceful stop):
              * booking_stress: 500 looping VUs for 1m30s (gracefulStop: 30s)


running (0m01.0s), 500/500 VUs, 40286 complete and 0 interrupted iterations
booking_stress   [   1% ] 500 VUs  0m01.0s/1m30s

running (0m02.0s), 500/500 VUs, 87573 complete and 0 interrupted iterations
booking_stress   [   2% ] 500 VUs  0m02.0s/1m30s

running (0m03.0s), 500/500 VUs, 137417 complete and 0 interrupted iterations
booking_stress   [   3% ] 500 VUs  0m03.0s/1m30s

running (0m04.0s), 500/500 VUs, 185571 complete and 0 interrupted iterations
booking_stress   [   4% ] 500 VUs  0m04.0s/1m30s

running (0m05.0s), 500/500 VUs, 232104 complete and 0 interrupted iterations
booking_stress   [   6% ] 500 VUs  0m05.0s/1m30s

running (0m06.0s), 500/500 VUs, 276838 complete and 0 interrupted iterations
booking_stress   [   7% ] 500 VUs  0m06.0s/1m30s

running (0m07.0s), 500/500 VUs, 321416 complete and 0 interrupted iterations
booking_stress   [   8% ] 500 VUs  0m07.0s/1m30s

running (0m08.0s), 500/500 VUs, 365464 complete and 0 interrupted iterations
booking_stress   [   9% ] 500 VUs  0m08.0s/1m30s

running (0m09.0s), 500/500 VUs, 407734 complete and 0 interrupted iterations
booking_stress   [  10% ] 500 VUs  0m09.0s/1m30s

running (0m10.0s), 500/500 VUs, 452815 complete and 0 interrupted iterations
booking_stress   [  11% ] 500 VUs  0m10.0s/1m30s

running (0m11.0s), 500/500 VUs, 499265 complete and 0 interrupted iterations
booking_stress   [  12% ] 500 VUs  0m11.0s/1m30s

running (0m12.0s), 500/500 VUs, 546359 complete and 0 interrupted iterations
booking_stress   [  13% ] 500 VUs  0m12.0s/1m30s

running (0m13.0s), 500/500 VUs, 593991 complete and 0 interrupted iterations
booking_stress   [  14% ] 500 VUs  0m13.0s/1m30s

running (0m14.0s), 500/500 VUs, 639781 complete and 0 interrupted iterations
booking_stress   [  16% ] 500 VUs  0m14.0s/1m30s

running (0m15.0s), 500/500 VUs, 686005 complete and 0 interrupted iterations
booking_stress   [  17% ] 500 VUs  0m15.0s/1m30s

running (0m16.0s), 500/500 VUs, 733428 complete and 0 interrupted iterations
booking_stress   [  18% ] 500 VUs  0m16.0s/1m30s

running (0m17.0s), 500/500 VUs, 779978 complete and 0 interrupted iterations
booking_stress   [  19% ] 500 VUs  0m17.0s/1m30s

running (0m18.0s), 500/500 VUs, 825324 complete and 0 interrupted iterations
booking_stress   [  20% ] 500 VUs  0m18.0s/1m30s

running (0m19.0s), 500/500 VUs, 871935 complete and 0 interrupted iterations
booking_stress   [  21% ] 500 VUs  0m19.0s/1m30s

running (0m20.0s), 500/500 VUs, 920317 complete and 0 interrupted iterations
booking_stress   [  22% ] 500 VUs  0m20.0s/1m30s

running (0m21.0s), 500/500 VUs, 966667 complete and 0 interrupted iterations
booking_stress   [  23% ] 500 VUs  0m21.0s/1m30s

running (0m22.0s), 500/500 VUs, 1011820 complete and 0 interrupted iterations
booking_stress   [  24% ] 500 VUs  0m22.0s/1m30s

running (0m23.0s), 500/500 VUs, 1040386 complete and 0 interrupted iterations
booking_stress   [  26% ] 500 VUs  0m23.0s/1m30s

running (0m24.0s), 500/500 VUs, 1074915 complete and 0 interrupted iterations
booking_stress   [  27% ] 500 VUs  0m24.0s/1m30s

running (0m25.0s), 500/500 VUs, 1117599 complete and 0 interrupted iterations
booking_stress   [  28% ] 500 VUs  0m25.0s/1m30s

running (0m26.0s), 500/500 VUs, 1163131 complete and 0 interrupted iterations
booking_stress   [  29% ] 500 VUs  0m26.0s/1m30s

running (0m27.0s), 500/500 VUs, 1211346 complete and 0 interrupted iterations
booking_stress   [  30% ] 500 VUs  0m27.0s/1m30s

running (0m28.0s), 500/500 VUs, 1257899 complete and 0 interrupted iterations
booking_stress   [  31% ] 500 VUs  0m28.0s/1m30s

running (0m29.0s), 500/500 VUs, 1304881 complete and 0 interrupted iterations
booking_stress   [  32% ] 500 VUs  0m29.0s/1m30s

running (0m30.0s), 500/500 VUs, 1352839 complete and 0 interrupted iterations
booking_stress   [  33% ] 500 VUs  0m30.0s/1m30s

running (0m31.0s), 500/500 VUs, 1400896 complete and 0 interrupted iterations
booking_stress   [  34% ] 500 VUs  0m31.0s/1m30s

running (0m32.0s), 500/500 VUs, 1448462 complete and 0 interrupted iterations
booking_stress   [  36% ] 500 VUs  0m32.0s/1m30s

running (0m33.0s), 500/500 VUs, 1497084 complete and 0 interrupted iterations
booking_stress   [  37% ] 500 VUs  0m33.0s/1m30s

running (0m34.0s), 500/500 VUs, 1545679 complete and 0 interrupted iterations
booking_stress   [  38% ] 500 VUs  0m34.0s/1m30s

running (0m35.0s), 500/500 VUs, 1589010 complete and 0 interrupted iterations
booking_stress   [  39% ] 500 VUs  0m35.0s/1m30s

running (0m36.0s), 500/500 VUs, 1634841 complete and 0 interrupted iterations
booking_stress   [  40% ] 500 VUs  0m36.0s/1m30s

running (0m37.0s), 500/500 VUs, 1681715 complete and 0 interrupted iterations
booking_stress   [  41% ] 500 VUs  0m37.0s/1m30s

running (0m38.0s), 500/500 VUs, 1728775 complete and 0 interrupted iterations
booking_stress   [  42% ] 500 VUs  0m38.0s/1m30s

running (0m39.0s), 500/500 VUs, 1770514 complete and 0 interrupted iterations
booking_stress   [  43% ] 500 VUs  0m39.0s/1m30s

running (0m40.0s), 500/500 VUs, 1816936 complete and 0 interrupted iterations
booking_stress   [  44% ] 500 VUs  0m40.0s/1m30s

running (0m41.0s), 500/500 VUs, 1865525 complete and 0 interrupted iterations
booking_stress   [  46% ] 500 VUs  0m41.0s/1m30s

running (0m42.0s), 500/500 VUs, 1914469 complete and 0 interrupted iterations
booking_stress   [  47% ] 500 VUs  0m42.0s/1m30s

running (0m43.0s), 500/500 VUs, 1963408 complete and 0 interrupted iterations
booking_stress   [  48% ] 500 VUs  0m43.0s/1m30s

running (0m44.0s), 500/500 VUs, 2012279 complete and 0 interrupted iterations
booking_stress   [  49% ] 500 VUs  0m44.0s/1m30s

running (0m45.0s), 500/500 VUs, 2060490 complete and 0 interrupted iterations
booking_stress   [  50% ] 500 VUs  0m45.0s/1m30s

running (0m46.0s), 500/500 VUs, 2107827 complete and 0 interrupted iterations
booking_stress   [  51% ] 500 VUs  0m46.0s/1m30s

running (0m47.0s), 500/500 VUs, 2157857 complete and 0 interrupted iterations
booking_stress   [  52% ] 500 VUs  0m47.0s/1m30s

running (0m48.0s), 500/500 VUs, 2207891 complete and 0 interrupted iterations
booking_stress   [  53% ] 500 VUs  0m48.0s/1m30s

running (0m49.0s), 500/500 VUs, 2256066 complete and 0 interrupted iterations
booking_stress   [  54% ] 500 VUs  0m49.0s/1m30s

running (0m50.0s), 500/500 VUs, 2306358 complete and 0 interrupted iterations
booking_stress   [  56% ] 500 VUs  0m50.0s/1m30s

running (0m51.0s), 500/500 VUs, 2352929 complete and 0 interrupted iterations
booking_stress   [  57% ] 500 VUs  0m51.0s/1m30s

running (0m52.0s), 500/500 VUs, 2402644 complete and 0 interrupted iterations
booking_stress   [  58% ] 500 VUs  0m52.0s/1m30s

running (0m53.0s), 500/500 VUs, 2451961 complete and 0 interrupted iterations
booking_stress   [  59% ] 500 VUs  0m53.0s/1m30s

running (0m54.0s), 500/500 VUs, 2503188 complete and 0 interrupted iterations
booking_stress   [  60% ] 500 VUs  0m54.0s/1m30s

running (0m55.0s), 500/500 VUs, 2546794 complete and 0 interrupted iterations
booking_stress   [  61% ] 500 VUs  0m55.0s/1m30s

running (0m56.0s), 500/500 VUs, 2595388 complete and 0 interrupted iterations
booking_stress   [  62% ] 500 VUs  0m56.0s/1m30s

running (0m57.0s), 500/500 VUs, 2644764 complete and 0 interrupted iterations
booking_stress   [  63% ] 500 VUs  0m57.0s/1m30s

running (0m58.0s), 500/500 VUs, 2684791 complete and 0 interrupted iterations
booking_stress   [  64% ] 500 VUs  0m58.0s/1m30s

running (0m59.0s), 500/500 VUs, 2728910 complete and 0 interrupted iterations
booking_stress   [  66% ] 500 VUs  0m59.0s/1m30s

running (1m00.0s), 500/500 VUs, 2777515 complete and 0 interrupted iterations
booking_stress   [  67% ] 500 VUs  1m00.0s/1m30s

running (1m01.0s), 500/500 VUs, 2826108 complete and 0 interrupted iterations
booking_stress   [  68% ] 500 VUs  1m01.0s/1m30s

running (1m02.0s), 500/500 VUs, 2874800 complete and 0 interrupted iterations
booking_stress   [  69% ] 500 VUs  1m02.0s/1m30s

running (1m03.0s), 500/500 VUs, 2924763 complete and 0 interrupted iterations
booking_stress   [  70% ] 500 VUs  1m03.0s/1m30s

running (1m04.0s), 500/500 VUs, 2973766 complete and 0 interrupted iterations
booking_stress   [  71% ] 500 VUs  1m04.0s/1m30s

running (1m05.0s), 500/500 VUs, 3022109 complete and 0 interrupted iterations
booking_stress   [  72% ] 500 VUs  1m05.0s/1m30s

running (1m06.0s), 500/500 VUs, 3071057 complete and 0 interrupted iterations
booking_stress   [  73% ] 500 VUs  1m06.0s/1m30s

running (1m07.0s), 500/500 VUs, 3120009 complete and 0 interrupted iterations
booking_stress   [  74% ] 500 VUs  1m07.0s/1m30s

running (1m08.0s), 500/500 VUs, 3166043 complete and 0 interrupted iterations
booking_stress   [  76% ] 500 VUs  1m08.0s/1m30s

running (1m09.0s), 500/500 VUs, 3211033 complete and 0 interrupted iterations
booking_stress   [  77% ] 500 VUs  1m09.0s/1m30s

running (1m10.0s), 500/500 VUs, 3256948 complete and 0 interrupted iterations
booking_stress   [  78% ] 500 VUs  1m10.0s/1m30s

running (1m11.0s), 500/500 VUs, 3301007 complete and 0 interrupted iterations
booking_stress   [  79% ] 500 VUs  1m11.0s/1m30s

running (1m12.0s), 500/500 VUs, 3350931 complete and 0 interrupted iterations
booking_stress   [  80% ] 500 VUs  1m12.0s/1m30s

running (1m13.0s), 500/500 VUs, 3401562 complete and 0 interrupted iterations
booking_stress   [  81% ] 500 VUs  1m13.0s/1m30s

running (1m14.0s), 500/500 VUs, 3451250 complete and 0 interrupted iterations
booking_stress   [  82% ] 500 VUs  1m14.0s/1m30s

running (1m15.0s), 500/500 VUs, 3501598 complete and 0 interrupted iterations
booking_stress   [  83% ] 500 VUs  1m15.0s/1m30s

running (1m16.0s), 500/500 VUs, 3538965 complete and 0 interrupted iterations
booking_stress   [  84% ] 500 VUs  1m16.0s/1m30s

running (1m17.0s), 500/500 VUs, 3572464 complete and 0 interrupted iterations
booking_stress   [  86% ] 500 VUs  1m17.0s/1m30s

running (1m18.0s), 500/500 VUs, 3618698 complete and 0 interrupted iterations
booking_stress   [  87% ] 500 VUs  1m18.0s/1m30s

running (1m19.0s), 500/500 VUs, 3664758 complete and 0 interrupted iterations
booking_stress   [  88% ] 500 VUs  1m19.0s/1m30s

running (1m20.0s), 500/500 VUs, 3702264 complete and 0 interrupted iterations
booking_stress   [  89% ] 500 VUs  1m20.0s/1m30s

running (1m21.0s), 500/500 VUs, 3749742 complete and 0 interrupted iterations
booking_stress   [  90% ] 500 VUs  1m21.0s/1m30s

running (1m22.0s), 500/500 VUs, 3798831 complete and 0 interrupted iterations
booking_stress   [  91% ] 500 VUs  1m22.0s/1m30s

running (1m23.0s), 500/500 VUs, 3846472 complete and 0 interrupted iterations
booking_stress   [  92% ] 500 VUs  1m23.0s/1m30s

running (1m24.0s), 500/500 VUs, 3895813 complete and 0 interrupted iterations
booking_stress   [  93% ] 500 VUs  1m24.0s/1m30s

running (1m25.0s), 500/500 VUs, 3944056 complete and 0 interrupted iterations
booking_stress   [  94% ] 500 VUs  1m25.0s/1m30s

running (1m26.0s), 500/500 VUs, 3991847 complete and 0 interrupted iterations
booking_stress   [  96% ] 500 VUs  1m26.0s/1m30s

running (1m27.0s), 500/500 VUs, 4029487 complete and 0 interrupted iterations
booking_stress   [  97% ] 500 VUs  1m27.0s/1m30s

running (1m28.0s), 500/500 VUs, 4073348 complete and 0 interrupted iterations
booking_stress   [  98% ] 500 VUs  1m28.0s/1m30s

running (1m29.0s), 500/500 VUs, 4121085 complete and 0 interrupted iterations
booking_stress   [  99% ] 500 VUs  1m29.0s/1m30s

running (1m30.0s), 500/500 VUs, 4170628 complete and 0 interrupted iterations
booking_stress   [ 100% ] 500 VUs  1m30.0s/1m30s

running (1m30.0s), 000/500 VUs, 4173091 complete and 0 interrupted iterations
booking_stress ✓ [ 100% ] 500 VUs  1m30s


  █ THRESHOLDS 

    business_errors
    ✓ 'rate<0.01' rate=0.00%

    http_req_duration
    ✓ 'p(95)<200' p(95)=16.31ms


  █ TOTAL RESULTS 

    checks_total.......: 12519274 139083.919698/s
    checks_succeeded...: 66.53%   8329680 out of 12519274
    checks_failed......: 33.46%   4189594 out of 12519274

    ✓ setup event created
    ✓ status is 202 or 409
    ✗ is sold out
      ↳  99% — ✓ 4156588 / ✗ 16503
    ✗ is duplicate
      ↳  0% — ✓ 0 / ✗ 4173091

    CUSTOM
    business_errors................: 0.00%   0 out of 4173091

    HTTP
    http_req_duration..............: avg=6.02ms  min=54.7µs  med=4.45ms max=401.58ms p(90)=12.3ms  p(95)=16.31ms
      { expected_response:true }...: avg=6.27ms  min=94.33µs med=4.4ms  max=68.93ms  p(90)=13.4ms  p(95)=18.39ms
    http_req_failed................: 99.60%  4156588 out of 4173092
    http_reqs......................: 4173092 46361.313972/s

    EXECUTION
    iteration_duration.............: avg=10.56ms min=81.29µs med=8.79ms max=401.62ms p(90)=20.25ms p(95)=24.87ms
    iterations.....................: 4173091 46361.302863/s
    vus............................: 500     min=500                max=500
    vus_max........................: 500     min=500                max=500

    NETWORK
    data_received..................: 857 MB  9.5 MB/s
    data_sent......................: 888 MB  9.9 MB/s



running (1m30.0s), 000/500 VUs, 4173091 complete and 0 interrupted iterations
booking_stress ✓ [ 100% ] 500 VUs  1m30s